BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM2B.PIC
        <edc:SFRDef edc:_addr="0x82" edc:access="nn------" edc:cname="TCCR1C" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="FOC1B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC1A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x83" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x84" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TCNT1" edc:desc="Timer/Counter1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x86" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ICR1" edc:desc="Timer/Counter1 Input Capture" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x88" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1A" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x8A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1B" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x8C" edc:offset="0x14"/>
        <edc:SFRDef edc:_addr="0xA0" edc:access="nnnnnnnn" edc:cname="PIFR0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOP0" edc:desc="End of PSC0 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRN0" edc:desc="Ramp Number" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PEV0A" edc:desc="External Event A Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEV0B" edc:desc="External Event B Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSEI0" edc:desc="PSC 0 Synchro Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC0A" edc:desc="PSC 0 Output A Activity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC0B" edc:desc="PSC 0 Output A Activity" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA1" edc:access="--nnn--n" edc:cname="PIM0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOPE0" edc:desc="End of Cycle Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PEVE0A" edc:desc="External Event A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEVE0B" edc:desc="External Event B Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSEIE0" edc:desc="PSC 0 Synchro Error Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xA2" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xA4" edc:access="nnnnnnnn" edc:cname="PIFR2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOP2" edc:desc="End of PSC2 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRN2" edc:desc="Ramp Number" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PEV2A" edc:desc="External Event A Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEV2B" edc:desc="External Event B Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSEI2" edc:desc="PSC 2 Synchro Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC2A" edc:desc="PSC 2 Output A Activity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC2B" edc:desc="PSC 2 Output A Activity" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA5" edc:access="--nnn--n" edc:cname="PIM2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOPE2" edc:desc="End of Cycle Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PEVE2A" edc:desc="External Event A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEVE2B" edc:desc="External Event B Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSEIE2" edc:desc="PSC 2 Synchro Error Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xA6" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0xAA" edc:access="nnnn-nnn" edc:cname="DACON" edc:nzwidth="0x8" ltx:memberofperipheral="DAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAEN" edc:desc="DAC Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAOE" edc:desc="DAC Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DALA" edc:desc="DAC Left Adjust" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DATS" edc:desc="DAC Trigger Selection Bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Analog Comparator 0" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Analog Comparator 1" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="External Interrupt Request 0" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Timer/Counter0 Compare Match A" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Timer/Counter0 Overflow" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Timer/Counter1 Compare Match B" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Timer/Counter1 Overflow" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Timer/Counter1 Capture Event" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DAATE" edc:desc="DAC Auto Trigger Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xAB" edc:access="nnnnnnnnnnnnnnnn" edc:cname="DAC" edc:nzwidth="0x10" ltx:memberofperipheral="DAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAC" edc:desc="DAC Data Register Bits" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
